views/layouts/main.php


AppAsset::register($this);

$categories = Categories::find()->orderBy(['created_at' => SORT_DESC])->all();
---
SELECT * FROM `categories` ORDER BY `created_at` DESC