controllers/SiteController.php

    public function actionIndex()
    {
        $slider_posts = Articles::find()
            ->orderBy(['rand()' => SORT_DESC])
            ->limit(5)
            ->all();

        $last_three_categories = Categories::find()
            ->orderBy(['created_at' => SORT_DESC])
            ->limit(3)
            ->all();

        $last_five_posts = Articles::find()
            ->orderBy(['created_at' => SORT_DESC])
            ->limit(5)
            ->all();
---
SELECT * FROM `articles` ORDER BY rand() DESC LIMIT 5
SELECT * FROM `categories` ORDER BY `created_at` DESC LIMIT 3
SELECT * FROM `articles` ORDER BY `created_at` DESC LIMIT 5

    public function actionSingle($post_id)
    {
        $post = Articles::findOne(['id' => $post_id]);

        $tags = MarkArticle::find()
            ->where(['post_id' => $post->id])
            ->all();

        $last_five_posts = Articles::find()
            ->orderBy(['created_at' => SORT_DESC])
            ->limit(5)
            ->all();

        $comment_count = Comments::find()
            ->where(['post_id' => $post_id, 'parent_id' => 0])
            ->count();
---
SELECT * FROM `articles` WHERE `id`='4'
SELECT * FROM `markArticle` WHERE `post_id`=4
SELECT * FROM `articles` ORDER BY `created_at` DESC LIMIT 5
SELECT COUNT(*) FROM `comments` WHERE (`post_id`='4') AND (`parent_id`=0)