views/site/_post.php

SELECT COUNT(*) FROM `comments` WHERE (`post_id`=5) AND (`parent_id`=0)
---
use yii\helpers\Url;
use app\models\Comments;

$comment_count = Comments::find()
    ->where(['post_id' => $model->id, 'parent_id' => 0])
    ->count();